USE test;
DROP TABLE IF EXISTS part;
CREATE TABLE part (
  `id` INT NOT NULL AUTO_INCREMENT,
  `title` VARCHAR(255) NOT NULL,
  `necessary` BIT(1) NOT NULL,
  `counts` INT NOT NULL,
  PRIMARY KEY (`id`));


INSERT INTO part (`title`, `necessary`, `counts`) VALUES ("Процессор",1, 15),
("Монитор",1,5),
("Клавиатура",1,6),
("Мышь",0,10),
("Колонки",0,3),
("Материнская плата",1,2),
("Видеокарта",0,7),
("Кардридер",0,1),
("Дисковод",0,2),
("Жесткий диск",1,5),
("Оперативная память",1,2),
("Микрофон",0,4),
("Коврик для мыши",0,8),
("Кулер процессора",1,0),
("Кулер для корпуса",0,10),
("Термопаста",1,5),
("Блок питания",1,2),
("Шнур питания",1,15),
("Шнур DVI",1,10),
("Наушники",0,10),
("Веб-камера",0,5);